Tekla.Structures.Analysis.AnalysisBar
The AnalysisBar class contains information related to analysis bars.

Tekla.Structures.Analysis.AnalysisBar._AnalysisType
The analysis type of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._CardinalPoint
The cardinal point of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._Material
The material of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._ProfileStart
The start profile of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._ProfileEnd
The end profile of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._Curvature
The curvature of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._Composite
The composite beam of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._AnalysisDesignCode
The analysis design code of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._Label
The label of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._Positions
The positions of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar._Members
The members of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.AnalysisType
The analysis type of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.CardinalPoint
The cardinal point of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Material
The material of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.ProfileStart
The start profile of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.ProfileEnd
The end profile of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Curvature
The curvature of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Composite
The composite beam of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.AnalysisDesignCode
The analysis design code of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Label
The label of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Positions
The position list of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Members
The member list of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Insert
Inserts an analysis bar.
The AnalysisModelName has to be set.
FatherObjectID = PartId

Tekla.Structures.Analysis.AnalysisBar.Select
Selects an analysis bar.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisBar.Modify
Modifies an analysis bar.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisBar.Delete
Deletes an analysis bar.
The AnalysisModelName has to be set.
The ID has to be set.

Tekla.Structures.Analysis.AnalysisBar.GetPositions
Gets the positions of the analysis bar.
Returns: The positions of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.GetMembers
Gets the members of the analysis bar.
Returns: The members of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.Add(Tekla.Structures.Analysis.AnalysisPosition)
Adds a position to the analysis bar.
AnalysisPosition: The position to be added.

Tekla.Structures.Analysis.AnalysisBar.InsertInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisBar.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisBar.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisBar.DeleteInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisBar.CreatePositionEnumerator
Create position enumerator.

Tekla.Structures.Analysis.AnalysisBar.CreateMemberEnumerator
Create member enumerator.

Tekla.Structures.Analysis.AnalysisBar.CollectData
Collects additional data.

Tekla.Structures.Analysis.AnalysisBar.AddAnalysisPosition(Tekla.Structures.Analysis.AnalysisPosition)
Adds position to analysis bar.
Also adds member.